In [70]:
import pandas as pd
import numpy as np

# 파일 읽기 (전처리)
- 파일을 읽어 올때 , sep 구분, names 컬럼 명 헤드 설정

## u.user : 사용자

In [2]:
user_col = ['user_id','age','gender','job','zip_code']
# user_col = ['아이디','나이','성별','직업','우편번호']

users = pd.read_csv('u.user',sep='|', names=user_col)
users[:3]

   user_id  age gender         job zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067

## 아이디를 인덱스로 변경

In [3]:
#컬럼 확인

In [4]:
users.columns

Index(['user_id', 'age', 'gender', 'job', 'zip_code'], dtype='object')

In [5]:
#인덱스로 변경

In [6]:
users.set_index('user_id',inplace=True)
users[:3]

         age gender         job zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067

In [7]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       943 non-null    int64
 1   gender    943 non-null    object
 2   job       943 non-null    object
 3   zip_code  943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [8]:
## 파일 저장, users.csv

In [9]:
users.to_csv('users.csv', encoding='UTF-8')

## u.item : 영화 정보
- 영화 아이디, 제목, 개봉 날짜, 장르,

In [12]:
item_col = ['movie_id', 'title', 'release date', 'a', 'imdb url', 'b', 'action',
            'adventure', 'animation', 'children', 'comedy', 'crime', 'documentary',
            'drama', 'fantasy', 'film-noir', 'horror', 'musical', 'mystery', 'romance',
            'sci-fi', 'thriller', 'war', 'western']

movies = pd.read_csv('u.item',encoding='latin-1',sep='|',names=item_col)
movies[:3]

,movie_id,title,release date,a,imdb url,b,action,adventure,animation,children,...,fantasy,film-noir,horror,musical,mystery,romance,sci-fi,thriller,war,western
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,...,0,0,0,0,0,0,0,1,0,0

In [13]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 24 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   movie_id      1682 non-null   int64
 1   title         1682 non-null   object
 2   release date  1681 non-null   object
 3   a             0 non-null      float64
 4   imdb url      1679 non-null   object
 5   b             1682 non-null   int64
 6   action        1682 non-null   int64
 7   adventure     1682 non-null   int64
 8   animation     1682 non-null   int64
 9   children      1682 non-null   int64
 10  comedy        1682 non-null   int64
 11  crime         1682 non-null   int64
 12  documentary   1682 non-null   int64
 13  drama         1682 non-null   int64
 14  fantasy       1682 non-null   int64
 15  film-noir     1682 non-null   int64
 16  horror        1682 non-null   int64
 17  musical       1682 non-null   int64
 18  mystery       1682 non-null   int64
 19  romance       1682 non-null   int64
 20  sci-fi        1682 non-null   int64
 21  thriller      1682 non-null   int64
 22  war           1682 non-null   int64
 23  western       1682 non-null   int64
dtypes: float64(1), int64(20), object(3)
memory usage: 315.5+ KB

In [17]:
movies.drop(columns=(['a','b']),inplace=True)

In [23]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 22 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   movie_id      1682 non-null   int64
 1   title         1682 non-null   object
 2   release date  1681 non-null   object
 3   imdb url      1679 non-null   object
 4   action        1682 non-null   int64
 5   adventure     1682 non-null   int64
 6   animation     1682 non-null   int64
 7   children      1682 non-null   int64
 8   comedy        1682 non-null   int64
 9   crime         1682 non-null   int64
 10  documentary   1682 non-null   int64
 11  drama         1682 non-null   int64
 12  fantasy       1682 non-null   int64
 13  film-noir     1682 non-null   int64
 14  horror        1682 non-null   int64
 15  musical       1682 non-null   int64
 16  mystery       1682 non-null   int64
 17  romance       1682 non-null   int64
 18  sci-fi        1682 non-null   int64
 19  thriller      1682 non-null   int64
 20  war           1682 non-null   int64
 21  western       1682 non-null   int64
dtypes: int64(19), object(3)
memory usage: 289.2+ KB

In [24]:
movies.set_index('movie_id',inplace=True)

In [32]:
movies.to_csv('movies.csv', encoding='UTF-8')

## 영화 평점 : u.data
- 사용자 아이디, 영화 아이디, 평점, timestamp 
- timestamp : 연도 날짜 시간

In [40]:
data_col = ['user_id','movie_id','rating','timestamp']

ratings = pd.read_csv('u.data',sep='\t',names=data_col)
ratings[:3]

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116

In [42]:
ratings.set_index('user_id',inplace=True)

In [44]:
ratings.sort_index(inplace=True)

In [51]:
ratings.to_csv('ratings.csv', encoding='utf-8')

# 추천 방식
- bestseller 가장 인기 있는 제품 상품을 추천
- 사용자 개인 정보가 없을 떄 사용

- 각 영화의 평점 평균을 구함, 평균값이 높은 것을 순서대로 추천

In [116]:
m_m=ratings.groupby('movie_id')['rating'].mean().sort_values(ascending=False)
m_m

movie_id
814     5.0
1599    5.0
1201    5.0
1122    5.0
1653    5.0
       ...
1568    1.0
1567    1.0
1566    1.0
1565    1.0
852     1.0
Name: rating, Length: 1682, dtype: float64

In [117]:
# best-seller 추천
# 함수 정의

In [130]:
def recom_movie(n_items):
    movie_sort = m_m[:n_items]
    recommend = movies.loc[movie_sort.index].title
    return recommend

In [131]:
# 함수 호출 
recom_movie(15)

movie_id
814                         Great Day in Harlem, A (1994)
1599                        Someone Else's America (1995)
1201           Marlene Dietrich: Shadow and Light (1996)
1122                       They Made Me a Criminal (1939)
1653    Entertaining Angels: The Dorothy Day Story (1996)
1293                                      Star Kid (1997)
1500                            Santa with Muscles (1996)
1189                                   Prefontaine (1997)
1536                                 Aiqing wansui (1994)
1467                 Saint of Fort Washington, The (1993)
1449                               Pather Panchali (1955)
119                Maya Lin: A Strong Clear Vision (1994)
1398                                          Anna (1996)
1642                             Some Mother's Son (1996)
1594                                       Everest (1998)
Name: title, dtype: object